Global("Locales", {})

function getLocale()
	return Locales[common.GetLocalization()] or Locales["eng"]
end

--------------------------------------------------------------------------------
-- Russian
--------------------------------------------------------------------------------

Locales["rus"]={}
Locales["rus"]["lineM"]="Кол-во мастерства"
Locales["rus"]["lineR"]="Кол-во решимости"
Locales["rus"]["lineB"]="Кол-во беспощадности"
Locales["rus"]["lineCrit"]="Кол-во удачи"
Locales["rus"]["lineDiff"]="Лучше текущих на:"
Locales["rus"]["resM"]="Не посчитано"
Locales["rus"]["resR"]="Не посчитано"
Locales["rus"]["resB"]="Не посчитано"
Locales["rus"]["resDiff"]="Не посчитано"
Locales["rus"]["resCrit"]="Не посчитано"
Locales["rus"]["resType1"]="Не посчитано"
Locales["rus"]["resType2"]="Не посчитано"
Locales["rus"]["resType3"]="Не посчитано"
Locales["rus"]["resType4"]="Не посчитано"
Locales["rus"]["calcButton1"]="Метод 1"
Locales["rus"]["calcButton2"]="Метод 2"
Locales["rus"]["desc"]="Производится расчет оптимального соотношения мастерства, беспощадности, решимости и удачи. Балансируются лишь те что уже вложены в указанные на текущий момент. Подбор господства, стремительности лежит на вас самих(они для каждого класса индивидуальны). Шаг рассчета 20 статов."
Locales["rus"]["amuletInfo"]="*Исходя из качества амулета считается, что он в среднем прибавляет мастерства: "
Locales["rus"]["useShop"]="Посчитать с шопом (+100)"
Locales["rus"]["useOrden"]="Посчитать с орденом (+100р)"
Locales["rus"]["amountOfR"]="Уровень решимости (0-100) : "
Locales["rus"]["useAlhim"]="Посчитать с алхимом (+50)"
Locales["rus"]["useEatR"]="Посчитать с едой (+25р)"
Locales["rus"]["useGuildCrit"]="Посчитать с гильдией (+40у)"
Locales["rus"]["useDoblest"]="Посчитать с доблестью"
Locales["rus"]["type1"]="Доля физического урона(%):"
Locales["rus"]["type2"]="Доля стихийного урона(%):"
Locales["rus"]["type3"]="Доля божественного урона(%):"
Locales["rus"]["type4"]="Доля природного урона(%):"
Locales["rus"]["lvlOfArt"]="Уровень Трикветра (0-10) : "
--------------------------------------------------------------------------------
-- English
--------------------------------------------------------------------------------

Locales["eng"]={}

